THEORY1_1 = 'Приведение примера к удобному виду является достаточно распространенным способом счета в уме. Давайте поймем, как применять этот способ на примерах:'
THEORY1_2_1 = '49*49 = (49*100)/2-49 – это действие можно рассматривать как 49*50, после вычитаем 49. Сначала считаем 49*100 = 4900. Затем 4900 делим на 2 и получаем 2450, затем вычитаем 49. Итого 24012.'
THEORY1_2_2 = '56*92 = 56*100 - 56*8 – сначала мы считаем сколько будет 56*100 и из этого числа вычитаем 56*(100-92). 5600-448=5152'
THEORY1_3 = 'Надеюсь, вы поняли, как работает этот метод. Этот способ отлично тренирует ваши мозги, но связан с большими мысленными затратами, также вероятность получить неправильный ответ если вы только начали пользоваться этим методом довольно высока'


THEORY2_1 = 'Для того, чтобы бездумно не возводить в квадрат по формуле все числа, нужно максимально упростить себе задачу следующими правилами.'

THEORY2_2 = 'Правило 1 (отсекает 10 чисел). Если число заканчивается на 0, умножить его не сложнее, чем однозначное число. Стоит лишь дописать пару нулей. В таблице отмечены красным.'

THEORY2_3 = 'Правило 2 (отсекает 10 чисел). Чтобы возвести в квадрат двузначное число, оканчивающееся на 5, нужно умножить первую цифру (x) на (x+1) и дописать к результату “25”. В таблице отмечены зеленым.'
THEORY2_3_2 = '75 * 75 = 7 * 8 = 56 … 25 = 5625.'

THEORY2_4 = 'Правило 3 (отсекает 8 чисел) Для чисел от 40 до 50. В таблице отмечены светло-оранжевым.'
THEORY2_4_2 = 'XX * XX = 1500 + 100 * вторую цифру + (10 - вторая цифра)^2'
THEORY2_4_3 = 'Достаточно трудно, верно? Давайте разберем пример:'
THEORY2_4_4 = '43 * 43 = 1500 + 100 * 3 + (10 - 3)^2 = 1500 + 300 + 49 = 1849.'

THEORY2_5 = 'Правило 4 (отсекает 8 чисел) Для чисел от 50 до 60. В таблице отмечены темно-оранжевым.'
THEORY2_5_1 = 'XX * XX = 2500 + 100 * вторую цифру + (вторая цифра)^2'
THEORY2_5_2 = 'Тоже достаточно трудно для восприятия. Давайте разберем пример:'
THEORY2_5_3 = '53 * 53 = 2500 + 100 * 3 + 3^2 = 2500 + 300 + 9 = 2809.'

THEORY2_6 = 'Правило 5 (отсекает 8 чисел) Для чисел от 90 до 100. В таблице отмечены темно-темно-оранжевым.'
THEORY2_6_1 = 'XX * XX = 8000+ 200 * вторую цифру+ (10 - вторая цифра)^2 '
THEORY2_6_2 = 'Похоже на правило 3, но с другими коэффициентами. Давайте разберем пример:'
THEORY2_6_3 = '93 * 93 = 8000 + 200 * 3 + (10 - 3)^2 = 8000 + 600 + 49 = 8649.'


THEORY3_1 = 'Для решения квадратных уравнений есть два способа, но сначала давайте разберем из чего состоит квадратное уравнение:'
THEORY3_1_1 = 'Квадратное уравнение — это ax2 + bx + c = 0, где a — первый или старший коэффициент, не равный нулю, b — второй коэффициент, c — свободный член.'

THEORY3_2 = 'Решение через дискриминант:'
THEORY3_2_1 = 'Для решения через дискриминант нужно знать его формулу'
THEORY3_2_2 = 'фото'
THEORY3_2_3 = 'х1 и x2 – это корни которые нам нужно узнать для решения уравнения'
THEORY3_2_4 = '(x + x1)(x + x2) = 0'

THEORY3_3 = 'Решение через теорему Виета:'
THEORY3_3_1 = 'Сумма корней x2 + bx + c = 0 равна коэффициенту b с противоположным знаком, а произведение корней равняется свободному члену '
THEORY3_3_2 = 'photo'
THEORY3_3_3 = 'Зная как образуются коэффициенты, мы можем разложить уравнение на скобки и узнать корни.'
THEORY3_3_4 = 'Давайте рассмотрим приведенное квадратное уравнение'
THEORY3_3_5 = 'X2 + 3x + 2 = 0'
THEORY3_3_6 = 'Значит: (x + 2)(x + 1) = x2 + x + 2x + 2 = x2 + 3x + 2 = 0'
THEORY3_3_7 = 'Где 3x это x + 2x, то есть сумма корней, а 2 это произведение корней.'